zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_SIC.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_CANXL_SIC.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_CANXL_SIC
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_CANXL_SIC_H_)  /* Check if memory map has not been already included */
#define S32K566_CANXL_SIC_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- CANXL_SIC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CANXL_SIC_Peripheral_Access_Layer CANXL_SIC Peripheral Access Layer
 * @{
 */

/** CANXL_SIC - Register Layout Typedef */
typedef struct CANXL_SIC_Struct {
  uint8_t RESERVED_0[64];
  __IO uint32_t SYSMC;                             /**< System Module Control, offset: 0x40 */
  __IO uint32_t SYSMCFG;                           /**< System Module Configuration, offset: 0x44 */
  __IO uint32_t SYSIE;                             /**< System Interrupt Enable, offset: 0x48 */
  __IO uint32_t SYSS;                              /**< System Status, offset: 0x4C */
  __I  uint32_t SYSFRTL;                           /**< System Free Running Timer Low, offset: 0x50 */
  __I  uint32_t SYSFRTH;                           /**< System Free Running Timer High, offset: 0x54 */
  __IO uint32_t SYSMDHICFG;                        /**< System Message Descriptor Host Interrupt Configuration, offset: 0x58 */
  uint8_t RESERVED_1[4];
  __IO uint32_t SYSMSG1;                           /**< System Message 1, offset: 0x60 */
  __IO uint32_t SYSMSG2;                           /**< System Message 2, offset: 0x64 */
  uint8_t RESERVED_2[24];
  __IO uint32_t BCFG1;                             /**< BCANXL Configuration 1, offset: 0x80 */
  __IO uint32_t BCFG2;                             /**< BCANXL Configuration 2, offset: 0x84 */
  uint8_t RESERVED_3[4];
  __IO uint32_t BBPRS;                             /**< BCANXL Bit Time Quanta Prescaler, offset: 0x8C */
  __IO uint32_t BNCBT;                             /**< BCANXL Nominal Bit Timing, offset: 0x90 */
  __IO uint32_t BFDCBT;                            /**< BCANXL FD Data Phase Bit Timing, offset: 0x94 */
  __IO uint32_t BXDCBT;                            /**< BCANXL XL Data Phase Bit Timing, offset: 0x98 */
  __IO uint32_t BTDCC;                             /**< BCANXL Transceiver Delay Compensation Control, offset: 0x9C */
  __IO uint32_t BMICI;                             /**< BCANXL PWM Configuration, offset: 0xA0 */
  __I  uint32_t BEC;                               /**< BCANXL Error Counter, offset: 0xA4 */
  uint8_t RESERVED_4[16];
  __I  uint32_t BST;                               /**< BCANXL Status, offset: 0xB8 */
  uint8_t RESERVED_5[4];
  __I  uint32_t BPCRC;                             /**< BCANXL Preface CRC, offset: 0xC0 */
  __I  uint32_t BCRC;                              /**< BCANXL CRC, offset: 0xC4 */
  __I  uint32_t BTDCS;                             /**< BCANXL Transceiver Delay Compensation Status, offset: 0xC8 */
} CANXL_SIC_Type, *CANXL_SIC_MemMapPtr;

/** Number of instances of the CANXL_SIC module. */
#define CANXL_SIC_INSTANCE_COUNT                 (1u)

/* CANXL_SIC - Peripheral instance base addresses */
/** Peripheral CANEXCEL__SIC base address */
#define IP_CANEXCEL__SIC_BASE                    (0x6A01B000u)
/** Peripheral CANEXCEL__SIC base pointer */
#define IP_CANEXCEL__SIC                         ((CANXL_SIC_Type *)IP_CANEXCEL__SIC_BASE)
/** Array initializer of CANXL_SIC peripheral base addresses */
#define IP_CANXL_SIC_BASE_ADDRS                  { IP_CANEXCEL__SIC_BASE }
/** Array initializer of CANXL_SIC peripheral base pointers */
#define IP_CANXL_SIC_BASE_PTRS                   { IP_CANEXCEL__SIC }

/* ----------------------------------------------------------------------------
   -- CANXL_SIC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CANXL_SIC_Register_Masks CANXL_SIC Register Masks
 * @{
 */

/*! @name SYSMC - System Module Control */
/*! @{ */

#define CANXL_SIC_SYSMC_FRZREQ_MASK              (0x1U)
#define CANXL_SIC_SYSMC_FRZREQ_SHIFT             (0U)
#define CANXL_SIC_SYSMC_FRZREQ_WIDTH             (1U)
#define CANXL_SIC_SYSMC_FRZREQ(x)                (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMC_FRZREQ_SHIFT)) & CANXL_SIC_SYSMC_FRZREQ_MASK)

#define CANXL_SIC_SYSMC_LPMREQ_MASK              (0x2U)
#define CANXL_SIC_SYSMC_LPMREQ_SHIFT             (1U)
#define CANXL_SIC_SYSMC_LPMREQ_WIDTH             (1U)
#define CANXL_SIC_SYSMC_LPMREQ(x)                (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMC_LPMREQ_SHIFT)) & CANXL_SIC_SYSMC_LPMREQ_MASK)

#define CANXL_SIC_SYSMC_MSGRREQ_MASK             (0x1000U)
#define CANXL_SIC_SYSMC_MSGRREQ_SHIFT            (12U)
#define CANXL_SIC_SYSMC_MSGRREQ_WIDTH            (1U)
#define CANXL_SIC_SYSMC_MSGRREQ(x)               (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMC_MSGRREQ_SHIFT)) & CANXL_SIC_SYSMC_MSGRREQ_MASK)

#define CANXL_SIC_SYSMC_SOFRST_MASK              (0x80000000U)
#define CANXL_SIC_SYSMC_SOFRST_SHIFT             (31U)
#define CANXL_SIC_SYSMC_SOFRST_WIDTH             (1U)
#define CANXL_SIC_SYSMC_SOFRST(x)                (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMC_SOFRST_SHIFT)) & CANXL_SIC_SYSMC_SOFRST_MASK)
/*! @} */

/*! @name SYSMCFG - System Module Configuration */
/*! @{ */

#define CANXL_SIC_SYSMCFG_FB1EN_MASK             (0x1U)
#define CANXL_SIC_SYSMCFG_FB1EN_SHIFT            (0U)
#define CANXL_SIC_SYSMCFG_FB1EN_WIDTH            (1U)
#define CANXL_SIC_SYSMCFG_FB1EN(x)               (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMCFG_FB1EN_SHIFT)) & CANXL_SIC_SYSMCFG_FB1EN_MASK)

#define CANXL_SIC_SYSMCFG_DRWRDIS_MASK           (0x2U)
#define CANXL_SIC_SYSMCFG_DRWRDIS_SHIFT          (1U)
#define CANXL_SIC_SYSMCFG_DRWRDIS_WIDTH          (1U)
#define CANXL_SIC_SYSMCFG_DRWRDIS(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMCFG_DRWRDIS_SHIFT)) & CANXL_SIC_SYSMCFG_DRWRDIS_MASK)

