zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_SIC.h
#define CANXL_SIC_SYSMCFG_JMPRNG_MASK            (0x4U)
#define CANXL_SIC_SYSMCFG_JMPRNG_SHIFT           (2U)
#define CANXL_SIC_SYSMCFG_JMPRNG_WIDTH           (1U)
#define CANXL_SIC_SYSMCFG_JMPRNG(x)              (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMCFG_JMPRNG_SHIFT)) & CANXL_SIC_SYSMCFG_JMPRNG_MASK)

#define CANXL_SIC_SYSMCFG_MRP_MASK               (0x8U)
#define CANXL_SIC_SYSMCFG_MRP_SHIFT              (3U)
#define CANXL_SIC_SYSMCFG_MRP_WIDTH              (1U)
#define CANXL_SIC_SYSMCFG_MRP(x)                 (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMCFG_MRP_SHIFT)) & CANXL_SIC_SYSMCFG_MRP_MASK)

#define CANXL_SIC_SYSMCFG_MAXTXMB_MASK           (0x7F0000U)
#define CANXL_SIC_SYSMCFG_MAXTXMB_SHIFT          (16U)
#define CANXL_SIC_SYSMCFG_MAXTXMB_WIDTH          (7U)
#define CANXL_SIC_SYSMCFG_MAXTXMB(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMCFG_MAXTXMB_SHIFT)) & CANXL_SIC_SYSMCFG_MAXTXMB_MASK)

#define CANXL_SIC_SYSMCFG_MAXRXMB_MASK           (0x7F000000U)
#define CANXL_SIC_SYSMCFG_MAXRXMB_SHIFT          (24U)
#define CANXL_SIC_SYSMCFG_MAXRXMB_WIDTH          (7U)
#define CANXL_SIC_SYSMCFG_MAXRXMB(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMCFG_MAXRXMB_SHIFT)) & CANXL_SIC_SYSMCFG_MAXRXMB_MASK)
/*! @} */

/*! @name SYSIE - System Interrupt Enable */
/*! @{ */

#define CANXL_SIC_SYSIE_FRZACKIE_MASK            (0x1U)
#define CANXL_SIC_SYSIE_FRZACKIE_SHIFT           (0U)
#define CANXL_SIC_SYSIE_FRZACKIE_WIDTH           (1U)
#define CANXL_SIC_SYSIE_FRZACKIE(x)              (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSIE_FRZACKIE_SHIFT)) & CANXL_SIC_SYSIE_FRZACKIE_MASK)

#define CANXL_SIC_SYSIE_LPMACKIE_MASK            (0x2U)
#define CANXL_SIC_SYSIE_LPMACKIE_SHIFT           (1U)
#define CANXL_SIC_SYSIE_LPMACKIE_WIDTH           (1U)
#define CANXL_SIC_SYSIE_LPMACKIE(x)              (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSIE_LPMACKIE_SHIFT)) & CANXL_SIC_SYSIE_LPMACKIE_MASK)

#define CANXL_SIC_SYSIE_MRUIE_MASK               (0x8U)
#define CANXL_SIC_SYSIE_MRUIE_SHIFT              (3U)
#define CANXL_SIC_SYSIE_MRUIE_WIDTH              (1U)
#define CANXL_SIC_SYSIE_MRUIE(x)                 (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSIE_MRUIE_SHIFT)) & CANXL_SIC_SYSIE_MRUIE_MASK)

#define CANXL_SIC_SYSIE_IERRIE_MASK              (0xF00U)
#define CANXL_SIC_SYSIE_IERRIE_SHIFT             (8U)
#define CANXL_SIC_SYSIE_IERRIE_WIDTH             (4U)
#define CANXL_SIC_SYSIE_IERRIE(x)                (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSIE_IERRIE_SHIFT)) & CANXL_SIC_SYSIE_IERRIE_MASK)

#define CANXL_SIC_SYSIE_MSGRNOTIE_MASK           (0x1000U)
#define CANXL_SIC_SYSIE_MSGRNOTIE_SHIFT          (12U)
#define CANXL_SIC_SYSIE_MSGRNOTIE_WIDTH          (1U)
#define CANXL_SIC_SYSIE_MSGRNOTIE(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSIE_MSGRNOTIE_SHIFT)) & CANXL_SIC_SYSIE_MSGRNOTIE_MASK)

#define CANXL_SIC_SYSIE_ABTACKIE_MASK            (0x2000U)
#define CANXL_SIC_SYSIE_ABTACKIE_SHIFT           (13U)
#define CANXL_SIC_SYSIE_ABTACKIE_WIDTH           (1U)
#define CANXL_SIC_SYSIE_ABTACKIE(x)              (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSIE_ABTACKIE_SHIFT)) & CANXL_SIC_SYSIE_ABTACKIE_MASK)

#define CANXL_SIC_SYSIE_CCNOTIE_MASK             (0x4000U)
#define CANXL_SIC_SYSIE_CCNOTIE_SHIFT            (14U)
#define CANXL_SIC_SYSIE_CCNOTIE_WIDTH            (1U)
#define CANXL_SIC_SYSIE_CCNOTIE(x)               (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSIE_CCNOTIE_SHIFT)) & CANXL_SIC_SYSIE_CCNOTIE_MASK)

#define CANXL_SIC_SYSIE_CERRIE_MASK              (0x10000U)
#define CANXL_SIC_SYSIE_CERRIE_SHIFT             (16U)
#define CANXL_SIC_SYSIE_CERRIE_WIDTH             (1U)
#define CANXL_SIC_SYSIE_CERRIE(x)                (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSIE_CERRIE_SHIFT)) & CANXL_SIC_SYSIE_CERRIE_MASK)

#define CANXL_SIC_SYSIE_CPERRIE_MASK             (0x20000U)
#define CANXL_SIC_SYSIE_CPERRIE_SHIFT            (17U)
#define CANXL_SIC_SYSIE_CPERRIE_WIDTH            (1U)
#define CANXL_SIC_SYSIE_CPERRIE(x)               (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSIE_CPERRIE_SHIFT)) & CANXL_SIC_SYSIE_CPERRIE_MASK)

#define CANXL_SIC_SYSIE_CBOFFIE_MASK             (0x40000U)
#define CANXL_SIC_SYSIE_CBOFFIE_SHIFT            (18U)
#define CANXL_SIC_SYSIE_CBOFFIE_WIDTH            (1U)
#define CANXL_SIC_SYSIE_CBOFFIE(x)               (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSIE_CBOFFIE_SHIFT)) & CANXL_SIC_SYSIE_CBOFFIE_MASK)

#define CANXL_SIC_SYSIE_CBDONEIE_MASK            (0x80000U)
#define CANXL_SIC_SYSIE_CBDONEIE_SHIFT           (19U)
#define CANXL_SIC_SYSIE_CBDONEIE_WIDTH           (1U)
#define CANXL_SIC_SYSIE_CBDONEIE(x)              (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSIE_CBDONEIE_SHIFT)) & CANXL_SIC_SYSIE_CBDONEIE_MASK)

#define CANXL_SIC_SYSIE_CRXWRNIE_MASK            (0x100000U)
#define CANXL_SIC_SYSIE_CRXWRNIE_SHIFT           (20U)
#define CANXL_SIC_SYSIE_CRXWRNIE_WIDTH           (1U)
#define CANXL_SIC_SYSIE_CRXWRNIE(x)              (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSIE_CRXWRNIE_SHIFT)) & CANXL_SIC_SYSIE_CRXWRNIE_MASK)

#define CANXL_SIC_SYSIE_CTXWRNIE_MASK            (0x200000U)
#define CANXL_SIC_SYSIE_CTXWRNIE_SHIFT           (21U)
#define CANXL_SIC_SYSIE_CTXWRNIE_WIDTH           (1U)
#define CANXL_SIC_SYSIE_CTXWRNIE(x)              (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSIE_CTXWRNIE_SHIFT)) & CANXL_SIC_SYSIE_CTXWRNIE_MASK)

#define CANXL_SIC_SYSIE_CFDPERRIE_MASK           (0x400000U)
#define CANXL_SIC_SYSIE_CFDPERRIE_SHIFT          (22U)
#define CANXL_SIC_SYSIE_CFDPERRIE_WIDTH          (1U)
#define CANXL_SIC_SYSIE_CFDPERRIE(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSIE_CFDPERRIE_SHIFT)) & CANXL_SIC_SYSIE_CFDPERRIE_MASK)

#define CANXL_SIC_SYSIE_CPREXCIE_MASK            (0x800000U)
#define CANXL_SIC_SYSIE_CPREXCIE_SHIFT           (23U)
#define CANXL_SIC_SYSIE_CPREXCIE_WIDTH           (1U)
#define CANXL_SIC_SYSIE_CPREXCIE(x)              (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSIE_CPREXCIE_SHIFT)) & CANXL_SIC_SYSIE_CPREXCIE_MASK)

#define CANXL_SIC_SYSIE_CDPERRIE_MASK            (0x1000000U)
#define CANXL_SIC_SYSIE_CDPERRIE_SHIFT           (24U)
#define CANXL_SIC_SYSIE_CDPERRIE_WIDTH           (1U)
#define CANXL_SIC_SYSIE_CDPERRIE(x)              (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSIE_CDPERRIE_SHIFT)) & CANXL_SIC_SYSIE_CDPERRIE_MASK)

