zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_SIC.h
#define CANXL_SIC_SYSIE_CTFUERRIR_MASK           (0x2000000U)
#define CANXL_SIC_SYSIE_CTFUERRIR_SHIFT          (25U)
#define CANXL_SIC_SYSIE_CTFUERRIR_WIDTH          (1U)
#define CANXL_SIC_SYSIE_CTFUERRIR(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSIE_CTFUERRIR_SHIFT)) & CANXL_SIC_SYSIE_CTFUERRIR_MASK)

#define CANXL_SIC_SYSIE_CRFOERRIR_MASK           (0x4000000U)
#define CANXL_SIC_SYSIE_CRFOERRIR_SHIFT          (26U)
#define CANXL_SIC_SYSIE_CRFOERRIR_WIDTH          (1U)
#define CANXL_SIC_SYSIE_CRFOERRIR(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSIE_CRFOERRIR_SHIFT)) & CANXL_SIC_SYSIE_CRFOERRIR_MASK)

#define CANXL_SIC_SYSIE_CLSERRIE_MASK            (0x8000000U)
#define CANXL_SIC_SYSIE_CLSERRIE_SHIFT           (27U)
#define CANXL_SIC_SYSIE_CLSERRIE_WIDTH           (1U)
#define CANXL_SIC_SYSIE_CLSERRIE(x)              (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSIE_CLSERRIE_SHIFT)) & CANXL_SIC_SYSIE_CLSERRIE_MASK)

#define CANXL_SIC_SYSIE_CMDOERRIE_MASK           (0x10000000U)
#define CANXL_SIC_SYSIE_CMDOERRIE_SHIFT          (28U)
#define CANXL_SIC_SYSIE_CMDOERRIE_WIDTH          (1U)
#define CANXL_SIC_SYSIE_CMDOERRIE(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSIE_CMDOERRIE_SHIFT)) & CANXL_SIC_SYSIE_CMDOERRIE_MASK)

#define CANXL_SIC_SYSIE_CMDUERRIE_MASK           (0x20000000U)
#define CANXL_SIC_SYSIE_CMDUERRIE_SHIFT          (29U)
#define CANXL_SIC_SYSIE_CMDUERRIE_WIDTH          (1U)
#define CANXL_SIC_SYSIE_CMDUERRIE(x)             (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSIE_CMDUERRIE_SHIFT)) & CANXL_SIC_SYSIE_CMDUERRIE_MASK)

#define CANXL_SIC_SYSIE_CRXSOERRIE_MASK          (0x40000000U)
#define CANXL_SIC_SYSIE_CRXSOERRIE_SHIFT         (30U)
#define CANXL_SIC_SYSIE_CRXSOERRIE_WIDTH         (1U)
#define CANXL_SIC_SYSIE_CRXSOERRIE(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSIE_CRXSOERRIE_SHIFT)) & CANXL_SIC_SYSIE_CRXSOERRIE_MASK)
/*! @} */

/*! @name SYSS - System Status */
/*! @{ */

#define CANXL_SIC_SYSS_FRZACKF_MASK              (0x1U)
#define CANXL_SIC_SYSS_FRZACKF_SHIFT             (0U)
#define CANXL_SIC_SYSS_FRZACKF_WIDTH             (1U)
#define CANXL_SIC_SYSS_FRZACKF(x)                (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSS_FRZACKF_SHIFT)) & CANXL_SIC_SYSS_FRZACKF_MASK)

#define CANXL_SIC_SYSS_LPMACKF_MASK              (0x2U)
#define CANXL_SIC_SYSS_LPMACKF_SHIFT             (1U)
#define CANXL_SIC_SYSS_LPMACKF_WIDTH             (1U)
#define CANXL_SIC_SYSS_LPMACKF(x)                (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSS_LPMACKF_SHIFT)) & CANXL_SIC_SYSS_LPMACKF_MASK)

#define CANXL_SIC_SYSS_NTRDY_MASK                (0x4U)
#define CANXL_SIC_SYSS_NTRDY_SHIFT               (2U)
#define CANXL_SIC_SYSS_NTRDY_WIDTH               (1U)
#define CANXL_SIC_SYSS_NTRDY(x)                  (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSS_NTRDY_SHIFT)) & CANXL_SIC_SYSS_NTRDY_MASK)

#define CANXL_SIC_SYSS_STATE_MASK                (0x70U)
#define CANXL_SIC_SYSS_STATE_SHIFT               (4U)
#define CANXL_SIC_SYSS_STATE_WIDTH               (3U)
#define CANXL_SIC_SYSS_STATE(x)                  (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSS_STATE_SHIFT)) & CANXL_SIC_SYSS_STATE_MASK)

#define CANXL_SIC_SYSS_IERR_MASK                 (0xF00U)
#define CANXL_SIC_SYSS_IERR_SHIFT                (8U)
#define CANXL_SIC_SYSS_IERR_WIDTH                (4U)
#define CANXL_SIC_SYSS_IERR(x)                   (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSS_IERR_SHIFT)) & CANXL_SIC_SYSS_IERR_MASK)

#define CANXL_SIC_SYSS_MSGRNOTF_MASK             (0x1000U)
#define CANXL_SIC_SYSS_MSGRNOTF_SHIFT            (12U)
#define CANXL_SIC_SYSS_MSGRNOTF_WIDTH            (1U)
#define CANXL_SIC_SYSS_MSGRNOTF(x)               (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSS_MSGRNOTF_SHIFT)) & CANXL_SIC_SYSS_MSGRNOTF_MASK)

#define CANXL_SIC_SYSS_ABTACK_MASK               (0x2000U)
#define CANXL_SIC_SYSS_ABTACK_SHIFT              (13U)
#define CANXL_SIC_SYSS_ABTACK_WIDTH              (1U)
#define CANXL_SIC_SYSS_ABTACK(x)                 (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSS_ABTACK_SHIFT)) & CANXL_SIC_SYSS_ABTACK_MASK)

#define CANXL_SIC_SYSS_CCNOTF_MASK               (0x4000U)
#define CANXL_SIC_SYSS_CCNOTF_SHIFT              (14U)
#define CANXL_SIC_SYSS_CCNOTF_WIDTH              (1U)
#define CANXL_SIC_SYSS_CCNOTF(x)                 (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSS_CCNOTF_SHIFT)) & CANXL_SIC_SYSS_CCNOTF_MASK)

#define CANXL_SIC_SYSS_CERR_MASK                 (0x10000U)
#define CANXL_SIC_SYSS_CERR_SHIFT                (16U)
#define CANXL_SIC_SYSS_CERR_WIDTH                (1U)
#define CANXL_SIC_SYSS_CERR(x)                   (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSS_CERR_SHIFT)) & CANXL_SIC_SYSS_CERR_MASK)

#define CANXL_SIC_SYSS_CPASERR_MASK              (0x20000U)
#define CANXL_SIC_SYSS_CPASERR_SHIFT             (17U)
#define CANXL_SIC_SYSS_CPASERR_WIDTH             (1U)
#define CANXL_SIC_SYSS_CPASERR(x)                (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSS_CPASERR_SHIFT)) & CANXL_SIC_SYSS_CPASERR_MASK)

#define CANXL_SIC_SYSS_CBOFF_MASK                (0x40000U)
#define CANXL_SIC_SYSS_CBOFF_SHIFT               (18U)
#define CANXL_SIC_SYSS_CBOFF_WIDTH               (1U)
#define CANXL_SIC_SYSS_CBOFF(x)                  (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSS_CBOFF_SHIFT)) & CANXL_SIC_SYSS_CBOFF_MASK)

#define CANXL_SIC_SYSS_CBDONE_MASK               (0x80000U)
#define CANXL_SIC_SYSS_CBDONE_SHIFT              (19U)
#define CANXL_SIC_SYSS_CBDONE_WIDTH              (1U)
#define CANXL_SIC_SYSS_CBDONE(x)                 (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSS_CBDONE_SHIFT)) & CANXL_SIC_SYSS_CBDONE_MASK)

#define CANXL_SIC_SYSS_CRXWRN_MASK               (0x100000U)
#define CANXL_SIC_SYSS_CRXWRN_SHIFT              (20U)
#define CANXL_SIC_SYSS_CRXWRN_WIDTH              (1U)
#define CANXL_SIC_SYSS_CRXWRN(x)                 (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSS_CRXWRN_SHIFT)) & CANXL_SIC_SYSS_CRXWRN_MASK)

#define CANXL_SIC_SYSS_CTXWRN_MASK               (0x200000U)
#define CANXL_SIC_SYSS_CTXWRN_SHIFT              (21U)
#define CANXL_SIC_SYSS_CTXWRN_WIDTH              (1U)
#define CANXL_SIC_SYSS_CTXWRN(x)                 (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSS_CTXWRN_SHIFT)) & CANXL_SIC_SYSS_CTXWRN_MASK)

#define CANXL_SIC_SYSS_CFDPERR_MASK              (0x400000U)
#define CANXL_SIC_SYSS_CFDPERR_SHIFT             (22U)
#define CANXL_SIC_SYSS_CFDPERR_WIDTH             (1U)
#define CANXL_SIC_SYSS_CFDPERR(x)                (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSS_CFDPERR_SHIFT)) & CANXL_SIC_SYSS_CFDPERR_MASK)

#define CANXL_SIC_SYSS_CPREXC_MASK               (0x800000U)
#define CANXL_SIC_SYSS_CPREXC_SHIFT              (23U)
#define CANXL_SIC_SYSS_CPREXC_WIDTH              (1U)
#define CANXL_SIC_SYSS_CPREXC(x)                 (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSS_CPREXC_SHIFT)) & CANXL_SIC_SYSS_CPREXC_MASK)

