zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_SIC.h
#define CANXL_SIC_SYSS_CXDPERR_MASK              (0x1000000U)
#define CANXL_SIC_SYSS_CXDPERR_SHIFT             (24U)
#define CANXL_SIC_SYSS_CXDPERR_WIDTH             (1U)
#define CANXL_SIC_SYSS_CXDPERR(x)                (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSS_CXDPERR_SHIFT)) & CANXL_SIC_SYSS_CXDPERR_MASK)

#define CANXL_SIC_SYSS_CTFUFLW_MASK              (0x2000000U)
#define CANXL_SIC_SYSS_CTFUFLW_SHIFT             (25U)
#define CANXL_SIC_SYSS_CTFUFLW_WIDTH             (1U)
#define CANXL_SIC_SYSS_CTFUFLW(x)                (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSS_CTFUFLW_SHIFT)) & CANXL_SIC_SYSS_CTFUFLW_MASK)

#define CANXL_SIC_SYSS_CRFOVR_MASK               (0x4000000U)
#define CANXL_SIC_SYSS_CRFOVR_SHIFT              (26U)
#define CANXL_SIC_SYSS_CRFOVR_WIDTH              (1U)
#define CANXL_SIC_SYSS_CRFOVR(x)                 (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSS_CRFOVR_SHIFT)) & CANXL_SIC_SYSS_CRFOVR_MASK)

#define CANXL_SIC_SYSS_CLOMSERR_MASK             (0x8000000U)
#define CANXL_SIC_SYSS_CLOMSERR_SHIFT            (27U)
#define CANXL_SIC_SYSS_CLOMSERR_WIDTH            (1U)
#define CANXL_SIC_SYSS_CLOMSERR(x)               (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSS_CLOMSERR_SHIFT)) & CANXL_SIC_SYSS_CLOMSERR_MASK)

#define CANXL_SIC_SYSS_CMDOERR_MASK              (0x10000000U)
#define CANXL_SIC_SYSS_CMDOERR_SHIFT             (28U)
#define CANXL_SIC_SYSS_CMDOERR_WIDTH             (1U)
#define CANXL_SIC_SYSS_CMDOERR(x)                (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSS_CMDOERR_SHIFT)) & CANXL_SIC_SYSS_CMDOERR_MASK)

#define CANXL_SIC_SYSS_CMDUERR_MASK              (0x20000000U)
#define CANXL_SIC_SYSS_CMDUERR_SHIFT             (29U)
#define CANXL_SIC_SYSS_CMDUERR_WIDTH             (1U)
#define CANXL_SIC_SYSS_CMDUERR(x)                (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSS_CMDUERR_SHIFT)) & CANXL_SIC_SYSS_CMDUERR_MASK)

#define CANXL_SIC_SYSS_CRXOERR_MASK              (0x40000000U)
#define CANXL_SIC_SYSS_CRXOERR_SHIFT             (30U)
#define CANXL_SIC_SYSS_CRXOERR_WIDTH             (1U)
#define CANXL_SIC_SYSS_CRXOERR(x)                (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSS_CRXOERR_SHIFT)) & CANXL_SIC_SYSS_CRXOERR_MASK)
/*! @} */

/*! @name SYSFRTL - System Free Running Timer Low */
/*! @{ */

#define CANXL_SIC_SYSFRTL_FRTL_MASK              (0xFFFFFFFFU)
#define CANXL_SIC_SYSFRTL_FRTL_SHIFT             (0U)
#define CANXL_SIC_SYSFRTL_FRTL_WIDTH             (32U)
#define CANXL_SIC_SYSFRTL_FRTL(x)                (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSFRTL_FRTL_SHIFT)) & CANXL_SIC_SYSFRTL_FRTL_MASK)
/*! @} */

/*! @name SYSFRTH - System Free Running Timer High */
/*! @{ */

#define CANXL_SIC_SYSFRTH_FRTH_MASK              (0xFFFFFFFFU)
#define CANXL_SIC_SYSFRTH_FRTH_SHIFT             (0U)
#define CANXL_SIC_SYSFRTH_FRTH_WIDTH             (32U)
#define CANXL_SIC_SYSFRTH_FRTH(x)                (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSFRTH_FRTH_SHIFT)) & CANXL_SIC_SYSFRTH_FRTH_MASK)
/*! @} */

/*! @name SYSMDHICFG - System Message Descriptor Host Interrupt Configuration */
/*! @{ */

#define CANXL_SIC_SYSMDHICFG_TXDCFGHI0_0_MASK    (0x1U)
#define CANXL_SIC_SYSMDHICFG_TXDCFGHI0_0_SHIFT   (0U)
#define CANXL_SIC_SYSMDHICFG_TXDCFGHI0_0_WIDTH   (1U)
#define CANXL_SIC_SYSMDHICFG_TXDCFGHI0_0(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMDHICFG_TXDCFGHI0_0_SHIFT)) & CANXL_SIC_SYSMDHICFG_TXDCFGHI0_0_MASK)

#define CANXL_SIC_SYSMDHICFG_TXDCFGHI0_1_MASK    (0x2U)
#define CANXL_SIC_SYSMDHICFG_TXDCFGHI0_1_SHIFT   (1U)
#define CANXL_SIC_SYSMDHICFG_TXDCFGHI0_1_WIDTH   (1U)
#define CANXL_SIC_SYSMDHICFG_TXDCFGHI0_1(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMDHICFG_TXDCFGHI0_1_SHIFT)) & CANXL_SIC_SYSMDHICFG_TXDCFGHI0_1_MASK)

#define CANXL_SIC_SYSMDHICFG_TXDCFGHI0_2_MASK    (0x4U)
#define CANXL_SIC_SYSMDHICFG_TXDCFGHI0_2_SHIFT   (2U)
#define CANXL_SIC_SYSMDHICFG_TXDCFGHI0_2_WIDTH   (1U)
#define CANXL_SIC_SYSMDHICFG_TXDCFGHI0_2(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMDHICFG_TXDCFGHI0_2_SHIFT)) & CANXL_SIC_SYSMDHICFG_TXDCFGHI0_2_MASK)

#define CANXL_SIC_SYSMDHICFG_TXDCFGHI0_3_MASK    (0x8U)
#define CANXL_SIC_SYSMDHICFG_TXDCFGHI0_3_SHIFT   (3U)
#define CANXL_SIC_SYSMDHICFG_TXDCFGHI0_3_WIDTH   (1U)
#define CANXL_SIC_SYSMDHICFG_TXDCFGHI0_3(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMDHICFG_TXDCFGHI0_3_SHIFT)) & CANXL_SIC_SYSMDHICFG_TXDCFGHI0_3_MASK)

#define CANXL_SIC_SYSMDHICFG_TXDCFGHI1_0_MASK    (0x100U)
#define CANXL_SIC_SYSMDHICFG_TXDCFGHI1_0_SHIFT   (8U)
#define CANXL_SIC_SYSMDHICFG_TXDCFGHI1_0_WIDTH   (1U)
#define CANXL_SIC_SYSMDHICFG_TXDCFGHI1_0(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMDHICFG_TXDCFGHI1_0_SHIFT)) & CANXL_SIC_SYSMDHICFG_TXDCFGHI1_0_MASK)

#define CANXL_SIC_SYSMDHICFG_TXDCFGHI1_1_MASK    (0x200U)
#define CANXL_SIC_SYSMDHICFG_TXDCFGHI1_1_SHIFT   (9U)
#define CANXL_SIC_SYSMDHICFG_TXDCFGHI1_1_WIDTH   (1U)
#define CANXL_SIC_SYSMDHICFG_TXDCFGHI1_1(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMDHICFG_TXDCFGHI1_1_SHIFT)) & CANXL_SIC_SYSMDHICFG_TXDCFGHI1_1_MASK)

#define CANXL_SIC_SYSMDHICFG_TXDCFGHI1_2_MASK    (0x400U)
#define CANXL_SIC_SYSMDHICFG_TXDCFGHI1_2_SHIFT   (10U)
#define CANXL_SIC_SYSMDHICFG_TXDCFGHI1_2_WIDTH   (1U)
#define CANXL_SIC_SYSMDHICFG_TXDCFGHI1_2(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMDHICFG_TXDCFGHI1_2_SHIFT)) & CANXL_SIC_SYSMDHICFG_TXDCFGHI1_2_MASK)

#define CANXL_SIC_SYSMDHICFG_TXDCFGHI1_3_MASK    (0x800U)
#define CANXL_SIC_SYSMDHICFG_TXDCFGHI1_3_SHIFT   (11U)
#define CANXL_SIC_SYSMDHICFG_TXDCFGHI1_3_WIDTH   (1U)
#define CANXL_SIC_SYSMDHICFG_TXDCFGHI1_3(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMDHICFG_TXDCFGHI1_3_SHIFT)) & CANXL_SIC_SYSMDHICFG_TXDCFGHI1_3_MASK)

#define CANXL_SIC_SYSMDHICFG_RXDCFGHI0_0_MASK    (0x10000U)
#define CANXL_SIC_SYSMDHICFG_RXDCFGHI0_0_SHIFT   (16U)
#define CANXL_SIC_SYSMDHICFG_RXDCFGHI0_0_WIDTH   (1U)
#define CANXL_SIC_SYSMDHICFG_RXDCFGHI0_0(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMDHICFG_RXDCFGHI0_0_SHIFT)) & CANXL_SIC_SYSMDHICFG_RXDCFGHI0_0_MASK)

#define CANXL_SIC_SYSMDHICFG_RXDCFGHI0_1_MASK    (0x20000U)
#define CANXL_SIC_SYSMDHICFG_RXDCFGHI0_1_SHIFT   (17U)
#define CANXL_SIC_SYSMDHICFG_RXDCFGHI0_1_WIDTH   (1U)
#define CANXL_SIC_SYSMDHICFG_RXDCFGHI0_1(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMDHICFG_RXDCFGHI0_1_SHIFT)) & CANXL_SIC_SYSMDHICFG_RXDCFGHI0_1_MASK)

#define CANXL_SIC_SYSMDHICFG_RXDCFGHI0_2_MASK    (0x40000U)
#define CANXL_SIC_SYSMDHICFG_RXDCFGHI0_2_SHIFT   (18U)
#define CANXL_SIC_SYSMDHICFG_RXDCFGHI0_2_WIDTH   (1U)
#define CANXL_SIC_SYSMDHICFG_RXDCFGHI0_2(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMDHICFG_RXDCFGHI0_2_SHIFT)) & CANXL_SIC_SYSMDHICFG_RXDCFGHI0_2_MASK)

#define CANXL_SIC_SYSMDHICFG_RXDCFGHI0_3_MASK    (0x80000U)
#define CANXL_SIC_SYSMDHICFG_RXDCFGHI0_3_SHIFT   (19U)
#define CANXL_SIC_SYSMDHICFG_RXDCFGHI0_3_WIDTH   (1U)
#define CANXL_SIC_SYSMDHICFG_RXDCFGHI0_3(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMDHICFG_RXDCFGHI0_3_SHIFT)) & CANXL_SIC_SYSMDHICFG_RXDCFGHI0_3_MASK)

#define CANXL_SIC_SYSMDHICFG_RXDCFGHI1_0_MASK    (0x1000000U)
#define CANXL_SIC_SYSMDHICFG_RXDCFGHI1_0_SHIFT   (24U)
#define CANXL_SIC_SYSMDHICFG_RXDCFGHI1_0_WIDTH   (1U)
#define CANXL_SIC_SYSMDHICFG_RXDCFGHI1_0(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMDHICFG_RXDCFGHI1_0_SHIFT)) & CANXL_SIC_SYSMDHICFG_RXDCFGHI1_0_MASK)

#define CANXL_SIC_SYSMDHICFG_RXDCFGHI1_1_MASK    (0x2000000U)
#define CANXL_SIC_SYSMDHICFG_RXDCFGHI1_1_SHIFT   (25U)
#define CANXL_SIC_SYSMDHICFG_RXDCFGHI1_1_WIDTH   (1U)
#define CANXL_SIC_SYSMDHICFG_RXDCFGHI1_1(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMDHICFG_RXDCFGHI1_1_SHIFT)) & CANXL_SIC_SYSMDHICFG_RXDCFGHI1_1_MASK)

