zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_SIC.h
#define CANXL_SIC_SYSMDHICFG_RXDCFGHI1_2_MASK    (0x4000000U)
#define CANXL_SIC_SYSMDHICFG_RXDCFGHI1_2_SHIFT   (26U)
#define CANXL_SIC_SYSMDHICFG_RXDCFGHI1_2_WIDTH   (1U)
#define CANXL_SIC_SYSMDHICFG_RXDCFGHI1_2(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMDHICFG_RXDCFGHI1_2_SHIFT)) & CANXL_SIC_SYSMDHICFG_RXDCFGHI1_2_MASK)

#define CANXL_SIC_SYSMDHICFG_RXDCFGHI1_3_MASK    (0x8000000U)
#define CANXL_SIC_SYSMDHICFG_RXDCFGHI1_3_SHIFT   (27U)
#define CANXL_SIC_SYSMDHICFG_RXDCFGHI1_3_WIDTH   (1U)
#define CANXL_SIC_SYSMDHICFG_RXDCFGHI1_3(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMDHICFG_RXDCFGHI1_3_SHIFT)) & CANXL_SIC_SYSMDHICFG_RXDCFGHI1_3_MASK)
/*! @} */

/*! @name SYSMSG1 - System Message 1 */
/*! @{ */

#define CANXL_SIC_SYSMSG1_DATA_MASK              (0xFFFFFFFFU)
#define CANXL_SIC_SYSMSG1_DATA_SHIFT             (0U)
#define CANXL_SIC_SYSMSG1_DATA_WIDTH             (32U)
#define CANXL_SIC_SYSMSG1_DATA(x)                (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMSG1_DATA_SHIFT)) & CANXL_SIC_SYSMSG1_DATA_MASK)
/*! @} */

/*! @name SYSMSG2 - System Message 2 */
/*! @{ */

#define CANXL_SIC_SYSMSG2_DATA_MASK              (0xFFFFFFFFU)
#define CANXL_SIC_SYSMSG2_DATA_SHIFT             (0U)
#define CANXL_SIC_SYSMSG2_DATA_WIDTH             (32U)
#define CANXL_SIC_SYSMSG2_DATA(x)                (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_SYSMSG2_DATA_SHIFT)) & CANXL_SIC_SYSMSG2_DATA_MASK)
/*! @} */

/*! @name BCFG1 - BCANXL Configuration 1 */
/*! @{ */

#define CANXL_SIC_BCFG1_ABRDIS_MASK              (0x1U)
#define CANXL_SIC_BCFG1_ABRDIS_SHIFT             (0U)
#define CANXL_SIC_BCFG1_ABRDIS_WIDTH             (1U)
#define CANXL_SIC_BCFG1_ABRDIS(x)                (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BCFG1_ABRDIS_SHIFT)) & CANXL_SIC_BCFG1_ABRDIS_MASK)

#define CANXL_SIC_BCFG1_FDRSDIS_MASK             (0x2U)
#define CANXL_SIC_BCFG1_FDRSDIS_SHIFT            (1U)
#define CANXL_SIC_BCFG1_FDRSDIS_WIDTH            (1U)
#define CANXL_SIC_BCFG1_FDRSDIS(x)               (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BCFG1_FDRSDIS_SHIFT)) & CANXL_SIC_BCFG1_FDRSDIS_MASK)
/*! @} */

/*! @name BCFG2 - BCANXL Configuration 2 */
/*! @{ */

#define CANXL_SIC_BCFG2_LPB_MASK                 (0x1U)
#define CANXL_SIC_BCFG2_LPB_SHIFT                (0U)
#define CANXL_SIC_BCFG2_LPB_WIDTH                (1U)
#define CANXL_SIC_BCFG2_LPB(x)                   (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BCFG2_LPB_SHIFT)) & CANXL_SIC_BCFG2_LPB_MASK)

#define CANXL_SIC_BCFG2_LOM_MASK                 (0x2U)
#define CANXL_SIC_BCFG2_LOM_SHIFT                (1U)
#define CANXL_SIC_BCFG2_LOM_WIDTH                (1U)
#define CANXL_SIC_BCFG2_LOM(x)                   (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BCFG2_LOM_SHIFT)) & CANXL_SIC_BCFG2_LOM_MASK)

#define CANXL_SIC_BCFG2_TSCAP_MASK               (0xCU)
#define CANXL_SIC_BCFG2_TSCAP_SHIFT              (2U)
#define CANXL_SIC_BCFG2_TSCAP_WIDTH              (2U)
#define CANXL_SIC_BCFG2_TSCAP(x)                 (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BCFG2_TSCAP_SHIFT)) & CANXL_SIC_BCFG2_TSCAP_MASK)

#define CANXL_SIC_BCFG2_SRXEN_MASK               (0x10U)
#define CANXL_SIC_BCFG2_SRXEN_SHIFT              (4U)
#define CANXL_SIC_BCFG2_SRXEN_WIDTH              (1U)
#define CANXL_SIC_BCFG2_SRXEN(x)                 (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BCFG2_SRXEN_SHIFT)) & CANXL_SIC_BCFG2_SRXEN_MASK)

#define CANXL_SIC_BCFG2_FDEN_MASK                (0x20U)
#define CANXL_SIC_BCFG2_FDEN_SHIFT               (5U)
#define CANXL_SIC_BCFG2_FDEN_WIDTH               (1U)
#define CANXL_SIC_BCFG2_FDEN(x)                  (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BCFG2_FDEN_SHIFT)) & CANXL_SIC_BCFG2_FDEN_MASK)

#define CANXL_SIC_BCFG2_PEXCE_MASK               (0x40U)
#define CANXL_SIC_BCFG2_PEXCE_SHIFT              (6U)
#define CANXL_SIC_BCFG2_PEXCE_WIDTH              (1U)
#define CANXL_SIC_BCFG2_PEXCE(x)                 (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BCFG2_PEXCE_SHIFT)) & CANXL_SIC_BCFG2_PEXCE_MASK)

#define CANXL_SIC_BCFG2_EDFLTDIS_MASK            (0x80U)
#define CANXL_SIC_BCFG2_EDFLTDIS_SHIFT           (7U)
#define CANXL_SIC_BCFG2_EDFLTDIS_WIDTH           (1U)
#define CANXL_SIC_BCFG2_EDFLTDIS(x)              (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BCFG2_EDFLTDIS_SHIFT)) & CANXL_SIC_BCFG2_EDFLTDIS_MASK)

#define CANXL_SIC_BCFG2_ROM_MASK                 (0x100U)
#define CANXL_SIC_BCFG2_ROM_SHIFT                (8U)
#define CANXL_SIC_BCFG2_ROM_WIDTH                (1U)
#define CANXL_SIC_BCFG2_ROM(x)                   (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BCFG2_ROM_SHIFT)) & CANXL_SIC_BCFG2_ROM_MASK)

#define CANXL_SIC_BCFG2_XLEN_MASK                (0x200U)
#define CANXL_SIC_BCFG2_XLEN_SHIFT               (9U)
#define CANXL_SIC_BCFG2_XLEN_WIDTH               (1U)
#define CANXL_SIC_BCFG2_XLEN(x)                  (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BCFG2_XLEN_SHIFT)) & CANXL_SIC_BCFG2_XLEN_MASK)

#define CANXL_SIC_BCFG2_XLER_MASK                (0x400U)
#define CANXL_SIC_BCFG2_XLER_SHIFT               (10U)
#define CANXL_SIC_BCFG2_XLER_WIDTH               (1U)
#define CANXL_SIC_BCFG2_XLER(x)                  (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BCFG2_XLER_SHIFT)) & CANXL_SIC_BCFG2_XLER_MASK)

#define CANXL_SIC_BCFG2_TMSE_MASK                (0x800U)
#define CANXL_SIC_BCFG2_TMSE_SHIFT               (11U)
#define CANXL_SIC_BCFG2_TMSE_WIDTH               (1U)
#define CANXL_SIC_BCFG2_TMSE(x)                  (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BCFG2_TMSE_SHIFT)) & CANXL_SIC_BCFG2_TMSE_MASK)

#define CANXL_SIC_BCFG2_TFER_MASK                (0x1000U)
#define CANXL_SIC_BCFG2_TFER_SHIFT               (12U)
#define CANXL_SIC_BCFG2_TFER_WIDTH               (1U)
#define CANXL_SIC_BCFG2_TFER(x)                  (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BCFG2_TFER_SHIFT)) & CANXL_SIC_BCFG2_TFER_MASK)

#define CANXL_SIC_BCFG2_TSS_MASK                 (0x2000U)
#define CANXL_SIC_BCFG2_TSS_SHIFT                (13U)
#define CANXL_SIC_BCFG2_TSS_WIDTH                (1U)
#define CANXL_SIC_BCFG2_TSS(x)                   (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BCFG2_TSS_SHIFT)) & CANXL_SIC_BCFG2_TSS_MASK)

