zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_SIC.h
#define CANXL_SIC_BCFG2_FPES_MASK                (0x20000000U)
#define CANXL_SIC_BCFG2_FPES_SHIFT               (29U)
#define CANXL_SIC_BCFG2_FPES_WIDTH               (1U)
#define CANXL_SIC_BCFG2_FPES(x)                  (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BCFG2_FPES_SHIFT)) & CANXL_SIC_BCFG2_FPES_MASK)
/*! @} */

/*! @name BBPRS - BCANXL Bit Time Quanta Prescaler */
/*! @{ */

#define CANXL_SIC_BBPRS_PRESDIV_MASK             (0xFFU)
#define CANXL_SIC_BBPRS_PRESDIV_SHIFT            (0U)
#define CANXL_SIC_BBPRS_PRESDIV_WIDTH            (8U)
#define CANXL_SIC_BBPRS_PRESDIV(x)               (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BBPRS_PRESDIV_SHIFT)) & CANXL_SIC_BBPRS_PRESDIV_MASK)
/*! @} */

/*! @name BNCBT - BCANXL Nominal Bit Timing */
/*! @{ */

#define CANXL_SIC_BNCBT_NTSEG1_MASK              (0x1FFU)
#define CANXL_SIC_BNCBT_NTSEG1_SHIFT             (0U)
#define CANXL_SIC_BNCBT_NTSEG1_WIDTH             (9U)
#define CANXL_SIC_BNCBT_NTSEG1(x)                (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BNCBT_NTSEG1_SHIFT)) & CANXL_SIC_BNCBT_NTSEG1_MASK)

#define CANXL_SIC_BNCBT_NTSEG2_MASK              (0x7F000U)
#define CANXL_SIC_BNCBT_NTSEG2_SHIFT             (12U)
#define CANXL_SIC_BNCBT_NTSEG2_WIDTH             (7U)
#define CANXL_SIC_BNCBT_NTSEG2(x)                (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BNCBT_NTSEG2_SHIFT)) & CANXL_SIC_BNCBT_NTSEG2_MASK)

#define CANXL_SIC_BNCBT_NRJW_MASK                (0x1FC00000U)
#define CANXL_SIC_BNCBT_NRJW_SHIFT               (22U)
#define CANXL_SIC_BNCBT_NRJW_WIDTH               (7U)
#define CANXL_SIC_BNCBT_NRJW(x)                  (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BNCBT_NRJW_SHIFT)) & CANXL_SIC_BNCBT_NRJW_MASK)
/*! @} */

/*! @name BFDCBT - BCANXL FD Data Phase Bit Timing */
/*! @{ */

#define CANXL_SIC_BFDCBT_FTSEG1_MASK             (0xFFU)
#define CANXL_SIC_BFDCBT_FTSEG1_SHIFT            (0U)
#define CANXL_SIC_BFDCBT_FTSEG1_WIDTH            (8U)
#define CANXL_SIC_BFDCBT_FTSEG1(x)               (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BFDCBT_FTSEG1_SHIFT)) & CANXL_SIC_BFDCBT_FTSEG1_MASK)

#define CANXL_SIC_BFDCBT_FTSEG2_MASK             (0x7F000U)
#define CANXL_SIC_BFDCBT_FTSEG2_SHIFT            (12U)
#define CANXL_SIC_BFDCBT_FTSEG2_WIDTH            (7U)
#define CANXL_SIC_BFDCBT_FTSEG2(x)               (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BFDCBT_FTSEG2_SHIFT)) & CANXL_SIC_BFDCBT_FTSEG2_MASK)

#define CANXL_SIC_BFDCBT_FRJW_MASK               (0x1FC00000U)
#define CANXL_SIC_BFDCBT_FRJW_SHIFT              (22U)
#define CANXL_SIC_BFDCBT_FRJW_WIDTH              (7U)
#define CANXL_SIC_BFDCBT_FRJW(x)                 (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BFDCBT_FRJW_SHIFT)) & CANXL_SIC_BFDCBT_FRJW_MASK)
/*! @} */

/*! @name BXDCBT - BCANXL XL Data Phase Bit Timing */
/*! @{ */

#define CANXL_SIC_BXDCBT_XTSEG1_MASK             (0xFFU)
#define CANXL_SIC_BXDCBT_XTSEG1_SHIFT            (0U)
#define CANXL_SIC_BXDCBT_XTSEG1_WIDTH            (8U)
#define CANXL_SIC_BXDCBT_XTSEG1(x)               (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BXDCBT_XTSEG1_SHIFT)) & CANXL_SIC_BXDCBT_XTSEG1_MASK)

#define CANXL_SIC_BXDCBT_XTSEG2_MASK             (0x7F000U)
#define CANXL_SIC_BXDCBT_XTSEG2_SHIFT            (12U)
#define CANXL_SIC_BXDCBT_XTSEG2_WIDTH            (7U)
#define CANXL_SIC_BXDCBT_XTSEG2(x)               (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BXDCBT_XTSEG2_SHIFT)) & CANXL_SIC_BXDCBT_XTSEG2_MASK)

#define CANXL_SIC_BXDCBT_XRJW_MASK               (0x1FC00000U)
#define CANXL_SIC_BXDCBT_XRJW_SHIFT              (22U)
#define CANXL_SIC_BXDCBT_XRJW_WIDTH              (7U)
#define CANXL_SIC_BXDCBT_XRJW(x)                 (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BXDCBT_XRJW_SHIFT)) & CANXL_SIC_BXDCBT_XRJW_MASK)
/*! @} */

/*! @name BTDCC - BCANXL Transceiver Delay Compensation Control */
/*! @{ */

#define CANXL_SIC_BTDCC_FTDCOFF_MASK             (0x7FU)
#define CANXL_SIC_BTDCC_FTDCOFF_SHIFT            (0U)
#define CANXL_SIC_BTDCC_FTDCOFF_WIDTH            (7U)
#define CANXL_SIC_BTDCC_FTDCOFF(x)               (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BTDCC_FTDCOFF_SHIFT)) & CANXL_SIC_BTDCC_FTDCOFF_MASK)

#define CANXL_SIC_BTDCC_FTDMDIS_MASK             (0x4000U)
#define CANXL_SIC_BTDCC_FTDMDIS_SHIFT            (14U)
#define CANXL_SIC_BTDCC_FTDMDIS_WIDTH            (1U)
#define CANXL_SIC_BTDCC_FTDMDIS(x)               (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BTDCC_FTDMDIS_SHIFT)) & CANXL_SIC_BTDCC_FTDMDIS_MASK)

#define CANXL_SIC_BTDCC_FTDCEN_MASK              (0x8000U)
#define CANXL_SIC_BTDCC_FTDCEN_SHIFT             (15U)
#define CANXL_SIC_BTDCC_FTDCEN_WIDTH             (1U)
#define CANXL_SIC_BTDCC_FTDCEN(x)                (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BTDCC_FTDCEN_SHIFT)) & CANXL_SIC_BTDCC_FTDCEN_MASK)

#define CANXL_SIC_BTDCC_XTDCOFF_MASK             (0xFF0000U)
#define CANXL_SIC_BTDCC_XTDCOFF_SHIFT            (16U)
#define CANXL_SIC_BTDCC_XTDCOFF_WIDTH            (8U)
#define CANXL_SIC_BTDCC_XTDCOFF(x)               (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BTDCC_XTDCOFF_SHIFT)) & CANXL_SIC_BTDCC_XTDCOFF_MASK)

#define CANXL_SIC_BTDCC_XTDMDIS_MASK             (0x40000000U)
#define CANXL_SIC_BTDCC_XTDMDIS_SHIFT            (30U)
#define CANXL_SIC_BTDCC_XTDMDIS_WIDTH            (1U)
#define CANXL_SIC_BTDCC_XTDMDIS(x)               (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BTDCC_XTDMDIS_SHIFT)) & CANXL_SIC_BTDCC_XTDMDIS_MASK)

#define CANXL_SIC_BTDCC_XTDCEN_MASK              (0x80000000U)
#define CANXL_SIC_BTDCC_XTDCEN_SHIFT             (31U)
#define CANXL_SIC_BTDCC_XTDCEN_WIDTH             (1U)
#define CANXL_SIC_BTDCC_XTDCEN(x)                (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BTDCC_XTDCEN_SHIFT)) & CANXL_SIC_BTDCC_XTDCEN_MASK)
/*! @} */

/*! @name BMICI - BCANXL PWM Configuration */
/*! @{ */

#define CANXL_SIC_BMICI_PWMO_MASK                (0x3FU)
#define CANXL_SIC_BMICI_PWMO_SHIFT               (0U)
#define CANXL_SIC_BMICI_PWMO_WIDTH               (6U)
#define CANXL_SIC_BMICI_PWMO(x)                  (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BMICI_PWMO_SHIFT)) & CANXL_SIC_BMICI_PWMO_MASK)

#define CANXL_SIC_BMICI_PWML_MASK                (0x3F00U)
#define CANXL_SIC_BMICI_PWML_SHIFT               (8U)
#define CANXL_SIC_BMICI_PWML_WIDTH               (6U)
#define CANXL_SIC_BMICI_PWML(x)                  (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BMICI_PWML_SHIFT)) & CANXL_SIC_BMICI_PWML_MASK)

#define CANXL_SIC_BMICI_PWMS_MASK                (0x3F0000U)
#define CANXL_SIC_BMICI_PWMS_SHIFT               (16U)
#define CANXL_SIC_BMICI_PWMS_WIDTH               (6U)
#define CANXL_SIC_BMICI_PWMS(x)                  (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BMICI_PWMS_SHIFT)) & CANXL_SIC_BMICI_PWMS_MASK)
/*! @} */

/*! @name BEC - BCANXL Error Counter */
/*! @{ */

