zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_SIC.h
#define CANXL_SIC_BEC_REC_MASK                   (0xFFU)
#define CANXL_SIC_BEC_REC_SHIFT                  (0U)
#define CANXL_SIC_BEC_REC_WIDTH                  (8U)
#define CANXL_SIC_BEC_REC(x)                     (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BEC_REC_SHIFT)) & CANXL_SIC_BEC_REC_MASK)

#define CANXL_SIC_BEC_TEC_MASK                   (0xFF00U)
#define CANXL_SIC_BEC_TEC_SHIFT                  (8U)
#define CANXL_SIC_BEC_TEC_WIDTH                  (8U)
#define CANXL_SIC_BEC_TEC(x)                     (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BEC_TEC_SHIFT)) & CANXL_SIC_BEC_TEC_MASK)

#define CANXL_SIC_BEC_DPREC_MASK                 (0xFF0000U)
#define CANXL_SIC_BEC_DPREC_SHIFT                (16U)
#define CANXL_SIC_BEC_DPREC_WIDTH                (8U)
#define CANXL_SIC_BEC_DPREC(x)                   (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BEC_DPREC_SHIFT)) & CANXL_SIC_BEC_DPREC_MASK)

#define CANXL_SIC_BEC_DPTEC_MASK                 (0xFF000000U)
#define CANXL_SIC_BEC_DPTEC_SHIFT                (24U)
#define CANXL_SIC_BEC_DPTEC_WIDTH                (8U)
#define CANXL_SIC_BEC_DPTEC(x)                   (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BEC_DPTEC_SHIFT)) & CANXL_SIC_BEC_DPTEC_MASK)
/*! @} */

/*! @name BST - BCANXL Status */
/*! @{ */

#define CANXL_SIC_BST_CANCS_MASK                 (0x3U)
#define CANXL_SIC_BST_CANCS_SHIFT                (0U)
#define CANXL_SIC_BST_CANCS_WIDTH                (2U)
#define CANXL_SIC_BST_CANCS(x)                   (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BST_CANCS_SHIFT)) & CANXL_SIC_BST_CANCS_MASK)

#define CANXL_SIC_BST_FLTCONF_MASK               (0xCU)
#define CANXL_SIC_BST_FLTCONF_SHIFT              (2U)
#define CANXL_SIC_BST_FLTCONF_WIDTH              (2U)
#define CANXL_SIC_BST_FLTCONF(x)                 (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BST_FLTCONF_SHIFT)) & CANXL_SIC_BST_FLTCONF_MASK)

#define CANXL_SIC_BST_RX_PIN_ST_MASK             (0x400000U)
#define CANXL_SIC_BST_RX_PIN_ST_SHIFT            (22U)
#define CANXL_SIC_BST_RX_PIN_ST_WIDTH            (1U)
#define CANXL_SIC_BST_RX_PIN_ST(x)               (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BST_RX_PIN_ST_SHIFT)) & CANXL_SIC_BST_RX_PIN_ST_MASK)
/*! @} */

/*! @name BPCRC - BCANXL Preface CRC */
/*! @{ */

#define CANXL_SIC_BPCRC_PCRC_MASK                (0x1FFFU)
#define CANXL_SIC_BPCRC_PCRC_SHIFT               (0U)
#define CANXL_SIC_BPCRC_PCRC_WIDTH               (13U)
#define CANXL_SIC_BPCRC_PCRC(x)                  (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BPCRC_PCRC_SHIFT)) & CANXL_SIC_BPCRC_PCRC_MASK)
/*! @} */

/*! @name BCRC - BCANXL CRC */
/*! @{ */

#define CANXL_SIC_BCRC_CRC_MASK                  (0x1FFFFFU)
#define CANXL_SIC_BCRC_CRC_SHIFT                 (0U)
#define CANXL_SIC_BCRC_CRC_WIDTH                 (21U)
#define CANXL_SIC_BCRC_CRC(x)                    (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BCRC_CRC_SHIFT)) & CANXL_SIC_BCRC_CRC_MASK)
/*! @} */

/*! @name BTDCS - BCANXL Transceiver Delay Compensation Status */
/*! @{ */

#define CANXL_SIC_BTDCS_TDCVAL_MASK              (0x1FFU)
#define CANXL_SIC_BTDCS_TDCVAL_SHIFT             (0U)
#define CANXL_SIC_BTDCS_TDCVAL_WIDTH             (9U)
#define CANXL_SIC_BTDCS_TDCVAL(x)                (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BTDCS_TDCVAL_SHIFT)) & CANXL_SIC_BTDCS_TDCVAL_MASK)

#define CANXL_SIC_BTDCS_TDCVT_MASK               (0x20000000U)
#define CANXL_SIC_BTDCS_TDCVT_SHIFT              (29U)
#define CANXL_SIC_BTDCS_TDCVT_WIDTH              (1U)
#define CANXL_SIC_BTDCS_TDCVT(x)                 (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BTDCS_TDCVT_SHIFT)) & CANXL_SIC_BTDCS_TDCVT_MASK)

#define CANXL_SIC_BTDCS_XTDCFAIL_MASK            (0x40000000U)
#define CANXL_SIC_BTDCS_XTDCFAIL_SHIFT           (30U)
#define CANXL_SIC_BTDCS_XTDCFAIL_WIDTH           (1U)
#define CANXL_SIC_BTDCS_XTDCFAIL(x)              (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BTDCS_XTDCFAIL_SHIFT)) & CANXL_SIC_BTDCS_XTDCFAIL_MASK)

#define CANXL_SIC_BTDCS_FTDCFAIL_MASK            (0x80000000U)
#define CANXL_SIC_BTDCS_FTDCFAIL_SHIFT           (31U)
#define CANXL_SIC_BTDCS_FTDCFAIL_WIDTH           (1U)
#define CANXL_SIC_BTDCS_FTDCFAIL(x)              (((uint32_t)(((uint32_t)(x)) << CANXL_SIC_BTDCS_FTDCFAIL_SHIFT)) & CANXL_SIC_BTDCS_FTDCFAIL_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group CANXL_SIC_Register_Masks */

/*!
 * @}
 */ /* end of group CANXL_SIC_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_CANXL_SIC_H_) */
